---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFile.Close
source: html/91802db4-8400-fbcb-995a-c7dbb45b074c.htm
---
# Autodesk.Revit.DB.IFC.IFCFile.Close Method

Close the IFC file.

## Syntax (C#)
```csharp
public void Close()
```